<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <link rel="icon" type="image/png" href="../assets/img/logo.png">
    <title>PAR</title>
    <link rel="stylesheet" href="../assets/css/style.css"/>
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Montserrat&display=swap" rel="stylesheet">
</head>
<body>
    <header>
        <nav>
            <img src="../assets/img/logo.png" alt="Logo-Salesianos" class="logo">
            <a href="https://www.centrodonbosco.es/" target="_blank"> Web </a>
            <a href="https://www.centrodonbosco.es/estudios/asir" target="_blank">ASIR</a>
            <!--<a href="mailto:alvarofernandezg@centrodonbosco.es?subject=Solicitud de información">Contáctanos</a>-->
            <a href="../index.html">Inicio</a>
        </nav>
    </header>

    <main>
        <h1> Planificaci&oacute;n y Administraci&oacute;n de Redes </h1>
    </main>
    <section>
    <h1 class="evaluaciones"><u>2ª Evaluaci&oacute;n</u></h1>

    <h2><u>Autenticaci&oacute;n mediante usuarios y contraseñas</u></h2>

    <p>
            Para realizar la autenticaci&oacute;n de usuarios y contraseñas deberemos de crear los usuarios &quot;Bart&quot;
            y &quot;lisa&quot;, para ello deberemos de meternos en vlan en el switch.
        <br>
            IOS ofrefrece la posibilidad de autenticaci&oacute;n por usuario, donde cada uno de ellos dispondr&aacute; de sus propias credenciales, eliminando de esta manera
            la contraseña compartida.
        <br><br><br>
            <u><strong>Configuraci&oacute;n de la Autenticaci&oacute;n &#40;2 t&eacute;cnicas&#41;&#58;</strong></u>
        <br><br>
            Local &#40;a trav&eacute;s de servidores AAA&#41;&#58;
        <br><br>
            El switch genera una base de datos en el propio dispositivo que almacena tanto los usuarios como las contraseñas definidas. Para realizar la configuraci&oacute;n
            primero de todo deberemos de crear los usuarios necesarios mediante la ejecuci&oacute;n del comando &#34;<em>username &#91;nombreUsuario&#93; password</em>&#34;
            y luego de ello debe de crear la contraseña ejecutando el comando &#34;<em>secret &#91;contraseñaUsuario&#93;</em>&#34;. La principal diferencia es que lo guarda
            cifrado y el otro lo guarda en texto plano. Debemos de habilitar la autenticaci&oacute;n sobre la conexi&oacute;n de consola y, en caso de que fuese necesario
            desde remoto &#34;<em>l&iacute;neas vty</em>&#34; ejecutando el comando &quot;<em>login local</em>&quot;.
        <br><br>
            Aqu&iacute; podr&aacute;s encontrar un ejemplo de como crear ambos usuarios&#58;
        <br><br>
            1&#45; <em><mark class="markPAR">SW1&#40;config&#41;&#35; username bart secret bart</mark></em>
        <br>
            2&#45; <em><mark class="markPAR">SW1&#40;config&#41;&#35; username lisa secret lisa</mark></em>
        <br>
            3&#45; <em><mark class="markPAR">SW1&#40;config&#41;&#35; line console 0</mark></em>
        <br>
            4&#45; <em><mark class="markPAR">SW1&#40;config&#45;line&#41;&#35; login local</mark></em>
        <br>
            4&#45; <em><mark class="markPAR">SW1&#40;config&#45;line&#41;&#35; exit</mark></em>
        <br>
            5&#45; <em><mark class="markPAR">SW1&#40;config&#41;&#35; line vty 0 3</mark></em>
        <br>
            6&#45; <em><mark class="markPAR">SW1&#40;config&#45;line&#41;&#35; login local</mark></em>
        <br>
            7&#45; <em><mark class="markPAR">SW1&#40;config&#45;line&#41;&#35; exit</mark></em>
        <br><br><br>
            <u><strong>Acceso por telnet a un switch de Cisco</strong></u>
        <br><br>
            Lo primero de todo deberemos de tener creado uno o varios usuarios en el switch, mediante autenticaci&oacute;n local o mediante servidores AAA. Muy <u>importante</u>,
            para poder establecer una conexi&oacute;n via remoto resulta imprescindible que el switch tenga configurada una direcci&oacute;n IP, dicha IP ser&aacute; utilizada
            para temas de administraci&oacute;n, nunca para tareas de la capa 3.
        <br>
            Para ello necesitaremos crear una interfaz virtual denominada <em>vlan interface</em> la cual me permite configurar una direcci&oacute;n IP y una m&aacute;scara
            asociada. Es necesario crear una interfaz virtual y no estar configurado directamente sobre una capa f&iacute;sica ya que dichas capas f&iacute;sicas de un switch
            s&oacute;lo operan en la capa 2.
        <br><br>
            Creaci&oacute;n de la interfaz virtual&#58;
        <br><br>
            1&#45; Asignamos direcciones IP a cada uno de los elementos involucrados en el esquema, en este caso un switch o un host.
        <br>
            2&#45; Deberemos de comprobar la vlan por defecto en el switch.
        <br>
            2.1.&#45; <em><mark class="markPAR">&#35; show vlan</mark></em> &#40;Muestra el conjunto de vlan utilizas y las interfaces asociadas a cada vlan&#41;.
        <br>
            2.2.&#45; <em><mark class="markPAR">SW1&#35; show vlan brief</mark></em> &#40;Mismo que el anterior sólo que mostrar&aacute; un resumen de vlans&#41;.
        <br>
            3&#45; Configurar la interfaz virtual a el switch.
        <br>
            3.1.&#45; <em><mark class="markPAR">SW&#40;config&#41;&#35; interface vlan1</mark></em> &#40;Seleccionamos la vlan con la que vamos a trabajar&#41;.
        <br>
            3.2.&#45; <em><mark class="markPAR">SW&#40;config&#45;if&#41;&#35; ip address &#91;InterfazVirtual&#93;&#91;MASK&#93;</mark></em> Ip address 10.0.2.100 con su m&aacute;scara 255.0.0.0.
        <br>
            4&#45; El &uacute;ltimo paso a realizar es subir dicha vlan ya que por defecto se encuentra bajada y o apagada. Para ello realizaremos la negación del comando shutdown.
        <br>
            SW&#40;config&#45;if&#41;&#35; No shutdown.
        <br>
            5&#45; Realizamos una conexión desde el PC al SW para ello utilizaremos el comando <em><mark class="markPAR">telnet + dirección IP a.telnet 10.0.2.100</mark></em>.
        <br><br>
            En el caso de que si tuvi&eacute;ra un analizador de tr&aacute;fico en la red podr&iacute;a ver en texto plano la informaci&oacute;n que pasa del cliente al servidor telnet.
        <br>
    </p>
    <p>
        <!-- Solucionar creo que el margin de las etiquetas <p> para las sub-páginas de las asignaturas-->
    </p>
    </section>
</body>
</html>