<!DOCTYPE html>
<html lang="es">
<head>
    <meta charset="UTF-8">
    <link rel="icon" type="image/png" href="../assets/img/logo.png">
    <title>LMGSI</title>
    <link rel="stylesheet" href="../assets/css/style.css"/>
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link href="https://fonts.googleapis.com/css2?family=Montserrat&display=swap" rel="stylesheet">
</head>
<body>
    <header>
        <nav>
            <img src="../assets/img/logo.png" alt="Logo-Salesianos" class="logo">
            <a href="../FHW/index.html">FHW</a>
            <a href="../GBD/index.html">GBD</a>
            <a href="../ISO/index.html">ISO</a>
            <a href="../PAR/index.html">PAR</a>
            <a href="../index.html">Inicio</a>
        </nav>
    </header>
    <main>
        <h1> Lenguajes de Marcas y Sistemas de Gesti&oacute;n de Informaci&oacute;n </h1>
        <br />
        <a href="html-ref/">Ver todas las referencias HTML</a>
        <h2 class="center"><u>Enlaces Anclas/Internos</u></h2>
        
        <p>
            Enlaces dentro de la misma p&aacute;gina. Son enlaces que nos permiten posicionarnos en un punto concreto del documento
            dentro de la misma p&aacute;gina. Por lo tanto, creamos un enlace que nmos lleva a un bloque de contenido de la p&aacute;gina.
            <br><br>
            ID Es un atributo presente en cualquier elemento de la p&aacute;gina y nos permite identificar
            dicho elemnto &#40;dengtro de la propia pagina&#41; <strong>CUIDADO</strong> no se pueden repetir los valores del identificador
            para ese atributo en cualquier otro elemento es unico.
            <br><br>
            Nuestros enlaces internos&#47;anclas este identificador ser&aacute; el denominado Ancla.
            <br><br>
            <code class="resaltado">&lt;h1 id="Ancla"&gt; Ir a mitad &lt;/h1&gt;</code>
            <br><br>
            Antes en lugar de utilizarse el id se utilizaba el atributo name dentro de la propia etiqueta &lt;a&gt;
            <br><br>
            Dos variantes de enlaces internos&#58;
            <br><br>
            Es decir, dentro de una carpeta accedo ala mitad o al final de la misma. Indica la posici&oacute;n interna en una URL absoluta. Acceso a la Wikipedia Historia de Palencia.
        </p>

        <h2 class="h2-LMGSI"><u>Atributos de Elementos &lt;a&gt;</u></h2>

        <p>
            El &uacute;nico atributo obligatorio en la etiqueta &lt;a&gt;  es el href que me permite indicar el destino del enlace. Pueden existir algunos atributos
            m&aacute;s que se pueden utilizar en la etiqueta &lt;a&gt;.
            <br><br>
            &#45; El atributo <u>tarjet</u> Permite indicar como se muestra la p&aacute;gina de destino.
            <code class="resaltado">tarjet="_blank"</code> nos permite abrir el enlace a una p&aacute;gina nueva, ya que esta es la opci&oacute; m&aacute;s utilizada.
            <br>
            &#45; El atributo <u>download</u> Permite que al hacer clic en el enlace, se abra autom&aacute;ticamente una pestaña y se descargar&aacute; el fichero.
            Claro est&aacute; de que ha este atributo se le puede añadir un nombre nuevo:
            <br>
            <code class="resaltado">download="prevencion.pdf"</code> lo cual nos va a descargar un fichero con el nombre que se ha indicado en el download.
            <br>
            <strong><u>NOTA</u></strong> El archivo original que se va a descargar se tiene que enyectar en el servidor.
            <code class="resaltado">href="documentos/fichaprev.pdf"</code>
            <br><br>
            &#45; El atributo <u>type</u> Simplemente nos permite indicar el tipo de contenido. A continuaci&oacute;n puedes observar varios ejemplos.
            <br>
            <code class="resaltado">&lt;a href="documentos/fichaprev.pdf"&gt;</code>
            <br>
            <code class="resaltado">type="application/pdf"</code> En este ejemplo nos indica que el enlace hace referencia a un documento de tipo pdf.
            <br>
            <code class="resaltado">&lt;a href="img/bacalao.png" type="image/png"&gt; descargar imagen &lt;/a&gt;</code>
        </p>

        <h2 class="h2-LMGSI"><u>Introducci&oacute;n a las Im&aacute;genes</u></h2>

        <p>
            Las im&aacute;genes son fundamentales para crear p&aacute;ginas web atractivas al usuario. Son el primer contenido NO TEXTUAL
            que se plante&oacute; incorporar en el est&aacute;ndar HTML.
            <br><br>
            Tipos&#58;
            <br><br>
            <u>Formato .jpg&#58;</u> Im&aacute;genes que ocupan muy poco espacio, alta comprensi&oacute;n. NO ADMITEN ANIMACIONES NI TRANSPARENCIAS. Formato habitual.
            <br><br>
            <u>Formato .gif&#58;</u> Im&aacute;genes con hasta 256 colores son buenas para dibujos y se pueden utilizar para animaciones &#40;su uso habitual&#41;.
            <br><br>
            <u>Formato .png&#58;</u> Im&aacute;genes fotogr&aacute;ficas comprimidas al estilo jpg pero con m&aacute;s calidad. Permite utilizar canales de opacidad
            &#40;transparencias&#41;, permiten utilizar un fondo y editar su opacidad.
            <br><br>
            <u>Formato .webp&#58;</u> Propio de Google, para hacer la competencia a .png y .jpg ocupan menos y tienen menor perdida de calidad. El problema
            est&aacute; en que solo es soportado por Google y por Opera.
            <br><br>
            <u>Formato .SVG&#58;</u> Formato vectorial de im&aacute;genes. Tienen la ventaja de que nunca pierden calidad independientemente de cuanto ampliemos la
            foto. Problemas de compatibilidad y de tamaño &#40;pesan mucho&#41;.
            <br><br><br>
            Elementos&#58;
            <br><br>
            <u>Elemento Figure&#58;</u> Agrupa elementos relativos a una im&aacute;gen como la propia im&aacute;gen, el t&iacute;tulo, el pie...
            <br><br>
            <u>Elemto Figcaption&#58;</u> Permite indicar el t&iacute;tulo de una imagen, dentro del elememto anterior &#40;figure&#41; haciendo efecto de un t&iacute;tulo con pie de im&aacute;gen.
        </p>

        <h2 class="h2-LMGSI"><u>Insercci&oacute;n de Im&aacute;genes</u></h2>

        <p>
            Las im&aacute;genes se colocan con la etiqueta <code class="resaltado">&#60;img&#62;</code>, importante de todo esto es que es una etiqueta que no tiene cierre.
            <br>
            Se considera texto, en el sentido de que yo puedo añadir otras im&aacute;genes en la misma linea e incluso en el propio texto &#34;inline&#34;.
            Para colocar de forma adecuada las im&aacute;genes se consigue mediante maquetaci&oacute;n de CSS.
            <br><br>
            Atributo&#58;
            <br><br>
            <u>Alt&#58;</u> Descripci&oacute;n de la foto y es un caracter obligatorio que indica un texto alternativo a la im&aacute;gen. Este texto aparece cuando la
            im&aacute;gen no puede cargarse. Este texto se tiene en cuenta en los buscadores con el fin de identificar la im&aacute;gen y a parte de eso permite
            conocer que tiene la fotografia &#40;ALT&#41;.
            <br><br>
            <u>Src&#58;</u> Atributo obligatorio, añadimos la ruta de a im&aacute;gen.
            <br><br>
            <u>Width &#47; Height&#58;</u> El primero me permite indicar la anchura de la im&aacute;gen y el segundo me permite indicar la altura de la im&aacute;gen.
            <br>
            <strong>NOTA&#58;</strong> Si añadimos tan solo uno de los dos atributos es capaz de calcular el otro valor a partir del añadido.
            <code class="resaltado">widht&#61;&#34;300px&#34;&#59;</code>
        </p>

        <h2 class="h2-LMGSI"><U>Etiqueta Picture junto con Source</U></h2>

        <p>
            Permite mostrar varios medios en una misma p&aacute;gina web. Si source va dentro de la etiqueta picture puede utilizarse para
            im&aacute;genes y esta tiene tres atributos&#58;
            <br><br>
            <u>Srcest&#58;</u> Indicar la direcci&oacute;n del archivo de la im&aacute;gen que queremos mostrar.
            <br><br>
            <u>Type&#58;</u> Me permite indicar el MIME del recurso que vamos a mostrar.
            <br><br>
            <u>MIME&#58;</u> Hace referencia al tipo de informaci&oacute;n que queremos mostrar.
            <br><br>
            <u>Media&#58;</u> Permite consultar el tipo de im&aacute;gen que se esta mostrando en la p&aacute;gina o para el tamaño de la p&aacute;gina web si
            queremos añadir diferentes p&aacute;ginas con distintos tamaños.
            <br>
            Ejemplo&#58; Inicialmente va a intentar mostrar la im&aacute;gen del primer source, si el navegador no es capaz
            de interpretar el tipo de esa im&aacute;gen mostrar&aacute; el segundo source &#40;si existe&#41; y si no mostrar&aacute;
            el valor de la etiqueta im&aacute;gen, y si no encuentra la etiqueta im&aacute;gen mostrar&aacute; el texto del
            atributo alt.
            <br><br>
            <code class="resaltado">&#60;picture&#62;
            <br>
                &#60;source media&#61;&#34;&#40;min-with:1000px&#41;&#34; srcest&#61;&#34;..&#47;..&#47;img&#47;aceituna.jpg&#34;&#62;
            <br>
                &#60;source srcest&#61;&#34;..&#47;..&#47;img&#47;cebolla.jpg&#34; media&#61;&#34;&#40;min-with:700px&#41;&#34;&#62;
            <br>
                &#60;img srcest&#61;&#34;..&#47;..&#47;img&#47;patata.jpg&#34; alt&#61;&#34;alimentaci&oacute;n&#34;&#62;
            <br>
			&#60;&#47;picture&#62;</code>
        </p>

        <h2 class="h2-LMGSI"><U>Elementos Multimedia</U></h2>

        <p>
            Esencialmente la base es la inclusi&oacute;n de im&aacute;genes pero cada vez m&aacute;s se agregan a las p&aacute;ginas web v&iacute;deos o sonidos
            en definitiva en elementos visuales que hagan a las p&aacute;ginas m&aacute;s atractivas.
            <br>
            El v&iacute;deo es un tipo de contenido que ocupa mucho espacio por lo que siempre se intenta comprimir al m&aacute;ximo su tamaño
            para ello se utliza software especial por estos motivos.
            <br><br><br>
            Formatos de v&iacute;deo utilizados en html5;
            <br><br>
            <u>MP4&#58;</u> Probablemente uno de los m&aacute;s populares ya que es compatible con los navegadores (tanto de pcs como
            de m&oacute;viles).
            <br><br>
            <u>WebM&#58;</u> Creado por Google pero es compatible CASI con todos los ordenadores, comprime mejor
            que el MP4 lo que hace que sea m&aacute;s optimo a la hora de visualizar el v&iacute;deo...
            <br><br>
            <u>OGG VIDEO&#58;</u>Es un formato abierto y sin patentes, vamos que es de codigo abierto.
            <br><br><br>
            Formas de incluir un v&iacute;deo&#58;
            <br><br>
            <code class="resaltado">< a href="../../img/video.mp4"> Ver video < /a >
            <br>
			< video src="../../img/video.mp4"> controls < /a >
            <br>
			< video src="../../img/video.mp4"> controls poster="../../img/patata.jp" < /a ></code>
            <br><br><br>
            Atributos del elemento v&iacute;deo&#58;
            <br><br>

        </p>
    </main>
    <footer>
        <article>
            <section>
                <div class="grid-container">
                    <div class="grid-item">&copy; Enrique Garc&iacute;a</div>
                    <div class="grid-item">&copy; &Aacute;lvaro Fern&aacute;ndez</div>
                </div>
            </section>
            <section>
                <div class="grid-container">
                    <div class="grid-item"><a href="https://www.centrodonbosco.es/" target="_blank">Centro Don Bosco</a></div>
                    <div class="grid-item"><a href="https://www.centrodonbosco.es/estudios/asir" target="_blank">ASIR</a></div>
                </div>
            </section>
        </article>
    </footer>
</body>
</html>

<!--
    &#40; (     &#41; )
    &#58; :     &#59; ;
    &#60; <     &#62; >
    &#34; "
    &#61; =
    &#47; /
-->
<!--

		Atributos del elemnto video:

			Src -> URL el video que se desea mostrar.

			Autoplay -> Usa el valor fijo de autoplay para iniciar el video de manera automática.

			Controls -> 	Con este valor indica que el navegador mostrara los controles para que el usuario pueda controlar
						la reproducción (parar, bajor subir el sonido, poner subtitulos, etc...)

			Poster -> 	Permite indicar la direcciónb URL de una imagen que s e mostrara mientras el video se encuentra
					reproduciemdo. Será eñ primer fotograma.

			Muted -> Quita sonido al video.

			Width y Height -> Altura y anchura del video.


			Añadie subtitulos:

				<video controls>

					<source src="../../img/video.mp4" type="video/mp4">
					
					<track kind="subtitles" src="../../img/videos/traducciones.vtt" srclang="es" label="Castellano">

				</video>

				.vtt -> tiempo de subtitulos.

			<video src="../../img/video.mp4"> controls autoplay muted" ->	Se reproduce el vídeo automáticamente, aparece la barra de herramientas
															y por defecto esta en silencio.

				SUBTITULOS:

					Los subtítulos me permiten traducir el contenido de un vídeo. Por ejemplo el video puede ser una canción grabada del inglés
					y los subtítulos nos lo mostrara traducido al español en tiempo real.

					Hay varios formatos/extensuiones para los subrtitulos por lo general cuandp se usan en la web se utiliza webVTT
					Ejemplo:	traduccionES.vtt

					Dentro de este fichero deberemos de incluir un parametro que es el WEBVTT.

					Acto y seguido podremos ir añadiendo los segundos del video en los que apareceran los subtitulos y lo que duran.

						00:00:01.150	->		00:00:03.150

                        ¿Cuánto durará en este caso la track del primer subtitulo?	En el ejemplo anterior durara 2 segundos.

                        A continuacion de estos segundos, indicaremos en la linea siguiente el texto a subtitular. ESFUERZOS.
    
                            <video>
    
                                <source src="esfuerzos.mp4" type="video/mp4">
    
                                <track kind="subtitles" src="traduccionES.vtt" srclang="es" label="Castellano">
    
                    ETIQYETA TRACK:
    
                        Me permite asignar subtitulos a un video, tiene los siguientes atributos:
    
                            Kind:
    
                                Tipo de subtitulos:
    
                                    Subtitles:	Subtitulos normales.
    
                            Label:	Nombre de los subtitulos para reconocerlos en el controls.
    
                            Srclang:	Indicar el codigo del idioma de los subtitulos.
-->